<?php
  // Имя каталога
  $dirname = ".";
  // Вызов функции, осуществляющей рекурсивный спуск по подкаталогам
  // корневого каталога
  scan_dir($dirname);

  ////////////////////////////////////////////////////////// 
  // Рекурсивная функция - спускаемся вниз по каталогу 
  ////////////////////////////////////////////////////////// 
  function scan_dir($dirname) 
  { 
    // Открываем текущий каталог 
    $dir = opendir($dirname); 
    // Читаем в цикле каталог 
    while (($file = readdir($dir)) !== false) 
    { 
      // Проверяем, не равно ли значение переменной
      // $file текущему или вышележащему каталогу
      if($file != "." && $file != "..") 
      { 
        $ftime = filectime($dirname."/".$file);
        if(date("Y") == date("Y",$ftime) && 
           date("m") == date("m",$ftime) &&
           date("d") == date("d",$ftime))
        {
          echo date("Y-m-d",$ftime)." ".$dirname."/".$file."<br>";
        }
        // Если перед нами каталог, вызываем рекурсивно 
        // функцию scan_dir 
        if(is_dir($dirname."/".$file)) 
        { 
          scan_dir($dirname."/".$file); 
       } 
     } 
   } 
   // Закрываем каталог 
   closedir($dir); 
  } 
?>
