<?php
  ////////////////////////////////////////////////////////// 
  // Рекурсивная функция - спускаемся вниз по каталогу 
  ////////////////////////////////////////////////////////// 
  function scan_dir($dirname) 
  { 
    // Открываем текущий каталог 
    $dir = opendir($dirname); 
    // Читаем в цикле каталог 
    while (($file = readdir($dir)) !== false) 
    { 
      // Проверяем, не равно ли значение переменной
      // $file имени текущего или вышележащего каталога
      if($file != "." && $file != "..") 
      { 
        // Если перед нами каталог, вызываем рекурсивно 
        // функцию scan_dir 
        if(is_dir("$dirname/$file")) 
        { 
          echo "$dirname/$file - ". 
               file_count("$dirname/$file")."<br>";
          scan_dir("$dirname/$file"); 
       } 
     } 
   } 
   // Закрываем каталог 
   closedir($dir); 
  } 
  ////////////////////////////////////////////////////////// 
  // Функция, вычисляющая количество файлов в каталоге
  ////////////////////////////////////////////////////////// 
  function file_count($dirname)
  {
    // Переменная для подсчета 
    $count = 0; 
    // Открываем каталог 
    $dir = opendir($dirname); 
    // В цикле считываем его содержимое 
    while(($file = readdir($dir))) 
    { 
      // Если текущий объект является файлом - считаем его 
      if(is_file("$dirname/$file")) ++$count; 
    } 
    // Закрываем каталог 
    closedir($dir); 
    return $count; 
  }

  // Имя каталога
  $dirname = "scripts";
  // Вызов функции, осуществляющей рекурсивный спуск по подкаталогам
  // корневого каталога
  scan_dir($dirname);
?>
