<?php
  ///////////////////////////////////////////////////////////////////
  // Блок загрузки динамики курса
  ///////////////////////////////////////////////////////////////////
  // Текущая дата
  $now_date = date("d/m/Y");
  // Дата месяц назад
  $last_date = date("d/m/Y", time() - 3600*24*30);
  // Формируем URL
  $url = "http://www.cbr.ru/scripts/XML_dynamic.asp?date_req1=".
          $last_date."&date_req2=".$now_date."&VAL_NM_RQ=R01235";
  // Получаем содержимое XML-файла
  $contents = file_get_contents($url);
  // Извлекаем курсы валют
  $pattern = "|<Record Date=\"([^\"]+)\".*<Value>([^<]+)<|isU";
  preg_match_all($pattern, $contents, $out);

  ///////////////////////////////////////////////////////////////////
  // Блок создания таблицы
  ///////////////////////////////////////////////////////////////////
  echo "<table border=1>";
  for($i = 0; $i < count($out[2]); $i++)
    echo "<tr><td>".$out[1][$i]."</td><td>".$out[2][$i]."</td></tr>";
  echo "</table>";
?>
