<?php
  ////////////////////////////////////////////////////////// 
  // Рекурсивная функция - спускаемся вниз по каталогу 
  ////////////////////////////////////////////////////////// 
  function scan_dir($dirname) 
  { 
    // Открываем текущий каталог 
    $dir = opendir($dirname); 
    // Читаем в цикле каталог 
    while (($file = readdir($dir)) !== false) 
    { 
      // Проверяем, не равно ли значение переменной
      // $file имени текущего или вышележащего каталога
      if($file != "." && $file != "..") 
      { 
        echo "$dirname/$file<br>";
        // Если перед нами каталог, вызываем рекурсивно 
        // функцию scan_dir 
        if(is_dir("$dirname/$file")) 
        { 
          scan_dir("$dirname/$file"); 
       } 
     } 
   } 
   // Закрываем каталог 
   closedir($dir); 
  } 

  // Имя каталога
  $dirname = ".";
  // Вызов функции, осуществляющей рекурсивный спуск по подкаталогам
  // корневого каталога
  scan_dir($dirname);
?>
