<?
	##################################################################
	##		Copyright by [CNS]BrainPhP (2007 г.)		##
	##								##
	##			PictireScaningForTable			##
	##			       PSFT v1.0			##
	##								##
	##		[CNS] - клан разработчика			##
	##		Brain - логин разработчика			##
	##		PhP   - доминирующий €зык разработки		##
	##								##
	##		realname: —тарцев ѕавел ¬€чеславович		##
	##								##
	##	------------------------------------------------	##
	##			—в€зь с автором:			##
	##	mailto: brain@shadrinsk.net				##
	##	url: http://cns.shadrinsk.net				##
	##	home phone: (35253)6-29-77				##
	##								##
	##	------------------------------------------------	##
	##								##
	##								##
	##################################################################



# максимальна€ ширина GIF
$conf['width']		=	100;

# маскимальна€ высота GIF
$conf['height']		=	100;

# max размер выданой €чейки таблицы в px
$conf['size']		=	5;

# max CELLSPACING - у таблицы
$conf['cellpac']	=	5;

# max CELLPADDING - у таблицы
$conf['cellpad']	=	5;



?>