<?
	##################################################################
	##		Copyright by [CNS]BrainPhP (2007 г.)		##
	##								##
	##			PictireScaningForTable			##
	##			       PSFT v1.0			##
	##								##
	##		[CNS] - клан разработчика			##
	##		Brain - логин разработчика			##
	##		PhP   - доминирующий язык разработки		##
	##								##
	##		realname: Старцев Павел Вячеславович		##
	##								##
	##	------------------------------------------------	##
	##			Связь с автором:			##
	##	mailto: brain@shadrinsk.net				##
	##	url: http://cns.shadrinsk.net				##
	##	home phone: (35253)6-29-77				##
	##								##
	##	------------------------------------------------	##
	##								##
	##								##
	##################################################################

	require './config.php';
	require './des/index.php';


?>